Revit 2027 API
TableCellCombinedParameterData Properties
The TableCellCombinedParameterData type exposes the following members.
Properties
Name | Description
CategoryId |  Category id for this parameter
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ParamId |  The parameter id
Prefix |  The prefix for this parameter
SampleValue |  The sample/example value for the parameter in text form
Separator |  The separator for this parameter
Suffix |  The suffix for this parameter
Top
See Also
Reference
TableCellCombinedParameterData Class
Autodesk.Revit.DB Namespace